In [15]:
#by using pandas we do all functionility of data 
#when we use just python not using pandas we will use the concept of dictionary where each keys
#represent columns and values represent the rows
#this is a simple dict
people={
    "first":['junaid','yasir','saddam'],
     "last":['shinwari','khan','hussain'],
    "email":['junaid@gmail.com','yasir@gmail.com','saddam@gmail.com']
    
}

people['last']

['shinwari', 'khan', 'hussain']

In [20]:
#here we can convert this dict data into dataframe (table)
#which assign index values automatically into each each rows
import pandas as pd
df=pd.DataFrame(people)
df.email
type(df.email)
#series :row of single columns is called series but dataframe is a whole is represent a table
#data frame can hold the multiple series it's container

pandas.core.series.Series

In [32]:
#accessing multiple columns data
df[['first','email']]

    first             email
0  junaid  junaid@gmail.com
1   yasir   yasir@gmail.com
2  saddam  saddam@gmail.com

In [54]:
df.groupby('first').size()

first
junaid    1
saddam    1
yasir     1
dtype: int64

In [63]:
#accessing sinle row
df.iloc[0]
#accessing multiple rows
df.iloc[[0,1]]

    first      last             email
0  junaid  shinwari  junaid@gmail.com
1   yasir      khan   yasir@gmail.com

In [90]:
#the 2nd one represent the columns index after comma
df.iloc[[0,2],[0,1]]

    first      last
0  junaid  shinwari
2  saddam   hussain

In [86]:
#it will take the columns name also as a 2nd argument first one represent rows index 
df.loc[[0,2],['first','last']]

    first      last
0  junaid  shinwari
2  saddam   hussain

In [103]:
df.set_index('email')

KeyError: "None of ['email'] are in the columns"

In [104]:
df

                   first      last
email
junaid@gmail.com  junaid  shinwari
yasir@gmail.com    yasir      khan
saddam@gmail.com  saddam   hussain

In [108]:
df.loc['junaid@gmail.com','first']

'junaid'

In [112]:
df.reset_index(inplace=True)

In [110]:
df.iloc[0]

first      junaid
last     shinwari
Name: junaid@gmail.com, dtype: object

In [113]:
df.index

RangeIndex(start=0, stop=3, step=1)